trade_exp/src/Documents/ПриемкаСдачаВыполненныхРаботУслуг/ПриемкаСдачаВыполненныхРаботУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="9b7637e6-ce8c-4067-a7ab-aebee7fb6068">
  <name>ПриемкаСдачаВыполненныхРаботУслуг</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="640075d1-a883-4c59-80f6-31455d14d3e4">
    <name>Заказчик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c8e1639f-b53e-4a57-a69d-df84fb1c3396">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="be9259cc-6103-496f-b8da-c2eaae517f04">
    <name>КоличествоВыданныхПарПерчаток</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="a815d23c-6101-4320-825f-c5d68475b788">
    <name>Подрядчик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ed5f409f-4846-44eb-a9f4-914ca9bd7fa5">
    <name>ВыполненныеРаботы</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2daf44ca-f6c9-4c0a-b088-30fe5c7042a0">
    <name>ОтправленоЭП</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a4811f6e-5f29-4eed-9385-a3228fb84314">
    <name>НомерАкта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="a09a2e36-26bb-40d4-8abd-3fc7f0c422cd">
    <name>ПланСотрудники</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="d7535430-f6c8-449f-85ef-104dd350e722">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d7396208-385c-44b3-9e3e-8ccfa1c8a787">
    <name>Клининг</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="9cd10099-ed23-4d2c-8d9a-e50b648b9689">
    <name>Работы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="c65163bf-7640-4259-b94a-ab619bda8de8">
      <name>ФИОРаботника</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="155b467d-4312-4d30-aa15-b97581ea6489">
      <name>ВидРабот</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="4c4b195d-a7b1-4a77-a8ff-90fbe2212df9">
      <name>ДатаИВремяНачалаРабот</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Time</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="82b83517-8cd6-4f21-8ab5-f0663cee7bf8">
      <name>ДатаИВремяОкончанияРабот</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Time</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="d748c77f-4708-4cbe-b920-f0768ef4f4bb">
      <name>ВремяФакт</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>4</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="8ba97333-0eeb-400e-8a1e-fb654d8dd31f">
      <name>Тариф</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="326208a3-3feb-44b6-b643-bce0dff7d121">
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="022dd625-7a4a-43b0-b5ba-60f92e90f97b">
      <name>КомментарийККачествуВыполненияРабот</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>500</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="d707e412-8c2b-42a5-8b58-02f355325460">
      <name>Сотрудник</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="09a7ae30-c9ad-449f-a5b4-48324c8c81c7">
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="387ddfc6-b06b-46b8-8b0a-344bb038777f">
      <name>ОплатаПодрядчику</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>12</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="920d3dfb-a4ed-471e-8227-326fddde53ae">
      <name>НомерТелефона</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>20</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="35c83be2-866b-431b-abf2-4386792699b4">
      <name>Банк</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>120</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="4795be15-525d-4650-9923-ef841e2026f3">
      <name>ДатаРабот</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="b6ce7b63-cc17-4f8b-bc12-d769e73575bb">
      <name>КлинингПлощадь</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="d86a4e2c-0ca3-425f-890a-25eeb78fb619">
      <name>КлинингВыполненныеРаботы</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>255</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="dae401cc-8b1f-4bb3-a37c-45d743269dc9">
      <name>КлинингОценкаКачества</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="1623805c-3e9f-40ab-855c-145ccf50a77c">
      <name>КлинингТариф</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>255</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/InformationRegisters/ЦеныНоменклатурыПоставщиков/ЦеныНоменклатурыПоставщиков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЦеныНоменклатурыПоставщиков</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="b32fa380-1610-4fb8-bfc7-02c958ebe249">
    <name>ВидЦеныПоставщика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Catalogs/СотрудникиАутсорс/СотрудникиАутсорс.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="84522b4b-02c5-4b70-b10f-f972972fb4c6">
  <name>СотрудникиАутсорс</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="6f35cbbf-f5a3-459a-a607-633d1c8e0857">
    <name>НомерТелефона</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="38fe249e-3835-4d73-a86a-1f21ace23d26">
    <name>Банк</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="a83ea452-7ac0-4107-b54b-f9c4e6d9e5d7">
    <name>НомерКарты</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>19</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="f7af57c6-f7c7-44ea-a409-a28230b64997">
    <name>ФИОПолучателя</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
</mdclass:Catalog>

trade_exp/src/Documents/ПриемкаСдачаВыполненныхРаботУслуг/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
//#Область ПрограммныйИнтерфейс

//Функция Организации(Организация) Экспорт
//	
//	СписокОрганизаций = Новый СписокЗначений;
//	СписокОрганизаций.Добавить(АльтерраОбщегоНазначения.ПолучитьАльтерра());
//	СписокОрганизаций.Добавить(АльтерраОбщегоНазначения.Получить1СК());
//	
//	
//	Возврат СписокОрганизаций;
//	
//КонецФункции

//#КонецОбласти

	
#Область Печать 

Процедура ПечатьДокумента(Документ) 
	
КонецПроцедуры

Функция СформироватьПечатнуюФорму(Документ, ЭтоСотрудник = Неопределено, Клининг = Ложь) Экспорт
	Если Клининг Тогда
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПриемкаСдачаВыполненныхРаботУслуг.МакетПриемкаСдача");
		Если ЭтоСотрудник = Неопределено Тогда
			Если Документ.Работы[0].Сотрудник <> Неопределено Тогда
				ЭтоСотрудник = Истина;
			КонецЕсли;
		КонецЕсли;
		ТабДокумент = Новый ТабличныйДокумент;
		Область = Макет.ПолучитьОбласть("Заголовок");
		Область.Параметры.Подрядчик = Документ.Подрядчик;
		Область.Параметры.Адрес = Документ.Подразделение.Адрес;
		Область.Параметры.Дата = Документ.Дата; 
		ТабДокумент.Вывести(Область);
		Область = Макет.ПолучитьОбласть("ЗаголовокТаблицыКлининг");
		ТабДокумент.Вывести(Область);
		ТабличнаяЧасть = Документ.Работы;
		ИтогСумма = 0;
		Для Каждого СтрокаТаблицы из ТабличнаяЧасть Цикл
			Область = Макет.ПолучитьОбласть("ТабличнаяЧастьКлининг");
			ЗаполнитьЗначенияСвойств(Область.Параметры, СтрокаТаблицы);
			ТабДокумент.Присоединить(Область);
		КонецЦикла;
		Область = Макет.ПолучитьОбласть("Подвал");
		НомерТелефона = ПолучитьТелефонПодрядчика(Документ.Подрядчик);
		Если НомерТелефона <> Неопределено Тогда
			Область.Параметры.Телефон = НомерТелефона;
		КонецЕсли;
		ТабДокумент.Вывести(Область);
		Возврат ТабДокумент;
	Иначе
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПриемкаСдачаВыполненныхРаботУслуг.МакетПриемкаСдача");
		Если ЭтоСотрудник = Неопределено Тогда
			Если Документ.Работы[0].Сотрудник <> Неопределено Тогда
				ЭтоСотрудник = Истина;
			КонецЕсли;
		КонецЕсли;
		ТабДокумент = Новый ТабличныйДокумент;
		Область = Макет.ПолучитьОбласть("Заголовок");
		Область.Параметры.Подрядчик = Документ.Подрядчик;
		Область.Параметры.Адрес = Документ.Подразделение.Адрес;
		Область.Параметры.Дата = Документ.Дата; 
		ТабДокумент.Вывести(Область);
		Область = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
		ТабДокумент.Вывести(Область);
		ТабличнаяЧасть = Документ.Работы;
		ИтогВремя = 0;
		ИтогСумма = 0;
		Для Каждого СтрокаТаблицы из ТабличнаяЧасть Цикл
			Область = Макет.ПолучитьОбласть("ТабличнаяЧасть");
			ЗаполнитьЗначенияСвойств(Область.Параметры, СтрокаТаблицы);
			СтруктураРеквизитовБанка = ПолучитьНомерКартыФИО(СтрокаТаблицы.ФИОРаботника);
			Если СтруктураРеквизитовБанка <> Неопределено Тогда
				ЗаполнитьЗначенияСвойств(Область.Параметры, СтруктураРеквизитовБанка)
			КонецЕсли;
			ИтогВремя = ИтогВремя + СтрокаТаблицы.ВремяФакт;
			ИтогСумма = ИтогСумма + СтрокаТаблицы.ОплатаПодрядчику;
			ТабДокумент.Присоединить(Область);
		КонецЦикла;
		Область = Макет.ПолучитьОбласть("Итоги");
		Область.Параметры.ИтогВремя = ИтогВремя;
		Область.Параметры.ИтогСумма = ИтогСумма;
		ТабДокумент.Вывести(Область);
		Область = Макет.ПолучитьОбласть("Подвал");
		НомерТелефона = ПолучитьТелефонПодрядчика(Документ.Подрядчик);
		Если НомерТелефона <> Неопределено Тогда
			Область.Параметры.Телефон = НомерТелефона;
		КонецЕсли;
		ТабДокумент.Вывести(Область);
		Возврат ТабДокумент; 
	КонецЕсли
КонецФункции

Функция ПолучитьНомерКартыФИО(СотрудникАутсорс)
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	СотрудникиАутсорс.НомерКарты КАК НомерКарты,
	|	СотрудникиАутсорс.ФИОПолучателя КАК Получатель
	|ИЗ
	|	Справочник.СотрудникиАутсорс КАК СотрудникиАутсорс
	|ГДЕ
	|	СотрудникиАутсорс.Ссылка = &Сотрудник";
	Запрос.УстановитьПараметр("Сотрудник", СотрудникАутсорс);
	Выборка = Запрос.Выполнить().Выбрать();
	Структура = Новый Структура;
	Пока Выборка.Следующий() Цикл
		Структура.Вставить("НомерКарты", Выборка.НомерКарты);
		Структура.Вставить("Получатель", Выборка.Получатель);
		Возврат Структура;
	КонецЦикла;	
	Возврат Неопределено;
КонецФункции

Функция ПолучитьТелефонПодрядчика(Подрядчик)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПартнерыКонтактнаяИнформация.НомерТелефона КАК НомерТелефона
	|ИЗ
	|	Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформация
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО (Контрагенты.Партнер = ПартнерыКонтактнаяИнформация.Ссылка)
	|ГДЕ
	|	ПартнерыКонтактнаяИнформация.НомерТелефона <> "" ""
	|	И Контрагенты.Ссылка = &Подрядчик";
	Запрос.УстановитьПараметр("Подрядчик", Подрядчик);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.НомерТелефона;
	КонецЦикла;
	Возврат Неопределено;
КонецФункции

Функция РассылкаИсполнителю(Документ) Экспорт
	
	ПолучательПисьма = ПолучитьАдресЭП(Документ.Подрядчик);
	Если ПолучательПисьма = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Адрес электронной почты Исполнителя не найден");
		Возврат Ложь;
	КонецЕсли;
	ТабДок = СформироватьПечатнуюФорму(Документ);  
	
	ИмяФайла = ПолучитьИмяВременногоФайла(".xlsx");
	ТабДок.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.xlsx);
	АдресФайлаВоВременномХранилище = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ИмяФайла));                     
                                                                                      
	МассивФайлов = Новый Массив;
	МассивФайлов.Добавить(Новый Структура("Представление, АдресВоВременномХранилище","Приемка-сдача выполненых работ (услуг)" + ".xlsx", АдресФайлаВоВременномХранилище));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ  
	|	ПрисоединенныеФайлы.Ссылка КАК Файл,
	|	ПрисоединенныеФайлы.Наименование КАК Наименование,
	|	ПрисоединенныеФайлы.Расширение КАК Расширение
	|ИЗ
	|	Справочник.ПриемкаСдачаВыполненныхРаботУслугПрисоединенныеФайлы КАК ПрисоединенныеФайлы
	|ГДЕ
	|	ПрисоединенныеФайлы.ВладелецФайла = &ВладелецФайла
	|	И НЕ ПрисоединенныеФайлы.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ВладелецФайла", Документ.Ссылка);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Количество() > 0 Тогда
		Пока Выборка.Следующий() Цикл
			ДанныеФайла = РаботаСФайлами.ДанныеФайла(Выборка.Файл);
			
			СтруктураФайла = Новый Структура("Представление, АдресВоВременномХранилище");
			СтруктураФайла.Представление = ДанныеФайла.ИмяФайла;
			СтруктураФайла.АдресВоВременномХранилище = ДанныеФайла.СсылкаНаДвоичныеДанныеФайла;
			
			МассивФайлов.Добавить(СтруктураФайла);
		КонецЦикла;
	КонецЕсли;	
	
	ПараметрыОтправки = Новый Структура;
	ПараметрыОтправки.Вставить("Кому", ПолучательПисьма);
	ПараметрыОтправки.Вставить("Тема", "Приемка-сдача работ "+Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy"));  

	ПараметрыОтправки.Вставить("Кодировка", КодировкаТекста.UTF8);
	ПараметрыОтправки.Вставить("ТипТекста", Перечисления.ТипыТекстовЭлектронныхПисем.ПростойТекст);
	ПараметрыОтправки.Вставить("Вложения", МассивФайлов);
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатОтправкиEmail = РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты, ПараметрыОтправки);		
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Истина;  
		
КонецФункции
#КонецОбласти
#КонецЕсли

Функция ПолучитьАдресЭП(Партнер)
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ПартнерыКонтактнаяИнформация.АдресЭП КАК Адрес
	|ИЗ
	|	Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформация
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО (Контрагенты.Партнер = ПартнерыКонтактнаяИнформация.Ссылка)
	|ГДЕ
	|	НЕ ПартнерыКонтактнаяИнформация.АдресЭП = """"
	|	И НЕ ПартнерыКонтактнаяИнформация.АдресЭП ЕСТЬ NULL
	|	И Контрагенты.Ссылка = &Партнер";
	Запрос.УстановитьПараметр("Партнер", Партнер);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Адрес;
	КонецЦикла;
	Возврат Неопределено;
КонецФункции

Функция ОпределениеЦеныРабот(Партнер,ВидРабот,Подразделение) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ЦеныНоменклатурыПоставщиковСрезПоследних.Цена КАК Цена
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатурыПоставщиков.СрезПоследних КАК ЦеныНоменклатурыПоставщиковСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО (Контрагенты.Партнер = ЦеныНоменклатурыПоставщиковСрезПоследних.Партнер)
	|ГДЕ
	|	ЦеныНоменклатурыПоставщиковСрезПоследних.НоменклатураПартнера = &НоменклатураПартнера
	|	И Контрагенты.Ссылка = &Партнер
	|	И ЦеныНоменклатурыПоставщиковСрезПоследних.ВидЦеныПоставщика.РегионПрисутствия = &РегионПрисутствия";
	Запрос.УстановитьПараметр("НоменклатураПартнера", ВидРабот);
	Запрос.УстановитьПараметр("РегионПрисутствия", Подразделение.РегионПрисутствия);
	Запрос.УстановитьПараметр("Партнер", Партнер);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		УстановитьПривилегированныйРежим(Ложь);
		Возврат Выборка.Цена;
	КонецЦикла;
	УстановитьПривилегированныйРежим(Ложь);
	Возврат Неопределено;
КонецФункции
